Strogino/src/Documents/Перемещение/Перемещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Перемещение</name>
  <basedOn>Document.Инвентаризация</basedOn>
  <registerRecords>AccumulationRegister.ТоварыКСборке</registerRecords>
  <registerRecords>AccumulationRegister.Претензии</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТовара</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПродажу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВведенАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводЗавершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>19</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвторПечати</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МестПростых</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестХолодных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрдернаяСхема</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БезУчетаДефектуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Инвентаризация</types>
    </type>
  </attributes>
  <attributes>
    <name>СборкаНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СборкаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.Партии</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Претензия</name>
      <type>
        <types>CatalogRef.Претензии</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Недовоз</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Перевоз</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Брак</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Лишний</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БракованнаяСерия</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Strogino/src/AccumulationRegisters/Претензии/Претензии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Претензии</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.Партии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Претензия</name>
    <type>
      <types>CatalogRef.Претензии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПретензии</name>
    <type>
      <types>DocumentRef.Претензия</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Strogino/src/Enums/ТипСборки/ТипСборки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипСборки</name>
  <enumValues>
    <name>СборкаЗаказа</name>
  </enumValues>
  <enumValues>
    <name>СборкаПеремещения</name>
  </enumValues>
  <enumValues>
    <name>СборкаЗаказовИзКоробки</name>
  </enumValues>
  <enumValues>
    <name>СнятиеРезерваПоОтмененнымЗаказам</name>
  </enumValues>
  <enumValues>
    <name>ОчисткаЯчеекОтТоваровПоОтмененнымЗаказам</name>
  </enumValues>
</mdclass:Enum>

Strogino/src/Documents/Сборка/Сборка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Сборка</name>
  <registerRecords>AccumulationRegister.ТоварыКСборке</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТовара</registerRecords>
  <registerRecords>AccumulationRegister.ХранениеЗСЯПоТоварам</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Холод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПотерь</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКоробкаСЦентральногоСклада</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСборки</name>
    <type>
      <types>EnumRef.ТипСборки</types>
    </type>
  </attributes>
  <attributes>
    <name>ШК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DefinedType.ДокументыРезервирующиеТовар</types>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.Партии</types>
      </type>
    </attributes>
    <attributes>
      <name>Холод</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСобрано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНеХватило</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрогрессСборки</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DefinedType.ДокументыРезервирующиеТовар</types>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.Партии</types>
      </type>
    </attributes>
    <attributes>
      <name>Холод</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Зона</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стелаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСобрано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНеХватило</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Потери</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DefinedType.ДокументыРезервирующиеТовар</types>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.Партии</types>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Резерв</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Strogino/src/Documents/Перемещение/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	АдресХраненияТекущейБазы = Константы.АдресХраненияТекущейБазы.Получить();
	
	Движения.ОстаткиТовара.БлокироватьДляИзменения = Истина;
	Движения.ОстаткиТовара.Очистить();
	Движения.ОстаткиТовара.Записывать = Истина;
	
	Движения.Претензии.Очистить(); 
	Движения.Претензии.Записывать = Истина;
	
	Движения.ТоварыКСборке.Очистить(); 
	Движения.ТоварыКСборке.Записывать = Истина;
	
	
	ЗапросПретензии = Новый Запрос;
	ЗапросПретензии.Текст = 
	"ВЫБРАТЬ
	|	Перемещение.Партия,
	|	Перемещение.Претензия,
	|	Перемещение.Ссылка.Поставщик как Отдел
	|ПОМЕСТИТЬ втПретензииБезПустых
	|ИЗ
	|	Документ.Перемещение.Товары КАК Перемещение
	|ГДЕ
	|	Перемещение.Ссылка = &Ссылка
	|	И Перемещение.Партия <> ЗНАЧЕНИЕ(Справочник.Партии.ПустаяСсылка)
	|	И Перемещение.Претензия <> ЗНАЧЕНИЕ(Справочник.Претензии.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПретензииОстатки.Склад,
	|	ПретензииОстатки.Партия КАК ПартияПретензии,
	|	ПретензииОстатки.Претензия,
	|	ПретензииОстатки.ДокументПретензии,
	|	ПретензииОстатки.СуммаОстаток КАК Сумма,
	|	ПретензииОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.Претензии.Остатки(
	|			&Дата,
	|			(Партия, Претензия, Склад) В
	|				(ВЫБРАТЬ
	|					втПретензииБезПустых.Партия,
	|					втПретензииБезПустых.Претензия,
	|					втПретензииБезПустых.Отдел
	|				ИЗ
	|					втПретензииБезПустых КАК втПретензииБезПустых)) КАК ПретензииОстатки";
	ЗапросПретензии.УстановитьПараметр("Ссылка",Ссылка);
	ЗапросПретензии.УстановитьПараметр("Дата",Новый Граница(МоментВремени(),ВидГраницы.Включая));
	
	ТЗОстатковПретензий = ЗапросПретензии.Выполнить().Выгрузить();
	
	Для каждого строка из Товары цикл
		Если ВводЗавершен тогда
			Если не СборкаНаТСД	и Строка.Количество <> 0 тогда
				Если ПолучитьПризнакФормированияРасходаПоСкладуПоставщику(Поставщик) тогда
					Движение = Движения.ОстаткиТовара.ДобавитьРасход();
					Движение.Период = Дата;
					Движение.Товар = Строка.Товар;
					Движение.Отдел = Поставщик;
					Движение.Партия = Строка.Партия;
					Движение.Остаток = Строка.Количество;
				КонецЕсли;
				Если не ОрдернаяСхема тогда
					Движение = Движения.ОстаткиТовара.ДобавитьПриход();
					Движение.Период = Дата;
					Движение.Товар = Строка.Товар;
					Движение.Отдел = Получатель;
					Движение.Партия = Строка.Партия;
					Движение.Остаток = Строка.Количество;
				КонецЕсли;
				
			ИначеЕсли СборкаНаТСД  Тогда
				Если строка.КоличествоПлан <> 0 тогда
					Движение = Движения.ТоварыКСборке.ДобавитьПриход();
					Движение.Документ = Ссылка;
					Движение.Регистратор = Ссылка;
					Движение.Партия = строка.Партия;
					Движение.Товар = Строка.Товар;
					Движение.Склад = Поставщик;
					Движение.Период = Дата;
					Движение.КоличествоКСборке = Строка.КоличествоПлан;
					Движение.ТипСборки = перечисления.ТипСборки.СборкаПеремещения;
					
					Движение = Движения.ОстаткиТовара.ДобавитьРасход();
					Движение.Период = Дата;
					Движение.Товар = Строка.Товар;
					Движение.Отдел = Поставщик;
					Движение.Партия = Строка.Партия;
					Движение.Остаток = Строка.КоличествоПлан;
					
					Движение = Движения.ОстаткиТовара.ДобавитьПриход();
					Движение.Период = Дата;
					Движение.Товар = Строка.Товар;
					Движение.Отдел = Поставщик;
					Движение.Партия = Строка.Партия;
					Движение.Резерв = Строка.КоличествоПлан;
				КонецЕсли;
				Если СборкаЗавершена и Строка.Количество <> 0 и не ОрдернаяСхема тогда
					Движение = Движения.ОстаткиТовара.ДобавитьПриход();
					Движение.Период = Дата;
					Движение.Товар = Строка.Товар;
					Движение.Отдел = Получатель;
					Движение.Партия = Строка.Партия;
					Движение.Остаток = Строка.Количество;				
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если Поставщик = АдресХраненияТекущейБазы.СкладВозвратов или Поставщик = АдресХраненияТекущейБазы.СкладПретензий тогда
			
			ОстаткиПоПартииПретензии = ТЗОстатковПретензий.Скопировать(Новый Структура("ПартияПретензии,Претензия",Строка.Партия,Строка.Претензия));		
			КолП = Строка.Количество;
			Для каждого остаток из ОстаткиПоПартииПретензии цикл
				Кол = остаток.Количество;
				Сум = остаток.Сумма;
				Если Кол = 0 Тогда Продолжить КонецЕсли;
				СписатьКол = Мин(Кол, КолП);   
				Если СписатьКол = Кол Тогда
					СписатьСумму = остаток.Сумма;
				Иначе                                            
					СписатьСумму = СписатьКол*строка.Партия.ЗакупочнаяЦена;
				КонецЕсли;
				Движение = Движения.Претензии.ДобавитьРасход();
				Движение.Период = Дата;
				Движение.Партия=строка.Партия;
				Движение.Претензия=строка.Претензия;
				Движение.Склад=остаток.Склад;  
				Движение.ДокументПретензии=остаток.ДокументПретензии;
				Движение.Количество=СписатьКол; 
				Движение.Сумма=СписатьСумму;
				Движение.Период = Дата;
				КолП = КолП-СписатьКол;  
				Если КолП=0 Тогда 
					Прервать 
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли;
	КонецЦикла;
	
	Если ВводЗавершен и (не СборкаНаТСД или СборкаНаТСД и СборкаЗавершена) тогда
		ЗапросОстатки = Новый Запрос;
		ЗапросОстатки.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеТовары.Ссылка.Поставщик КАК Отдел,
		|	ПеремещениеТовары.Товар,
		|	ПеремещениеТовары.Партия
		|ПОМЕСТИТЬ СрезОстатков
		|ИЗ
		|	Документ.Перемещение.Товары КАК ПеремещениеТовары
		|ГДЕ
		|	ПеремещениеТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиТовараОстатки.Товар,
		|	ОстаткиТовараОстатки.Отдел,
		|	ОстаткиТовараОстатки.Партия,
		|	ОстаткиТовараОстатки.ОстатокОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТовара.Остатки(
		|			&Дата,
		|			(Отдел, Товар, Партия) В
		|				(ВЫБРАТЬ
		|					СрезОстатков.Отдел,
		|					СрезОстатков.Товар,
		|					СрезОстатков.Партия
		|				ИЗ
		|					СрезОстатков КАК СрезОстатков)) КАК ОстаткиТовараОстатки
		|ГДЕ
		|	ОстаткиТовараОстатки.ОстатокОстаток < 0";
		ЗапросОстатки.УстановитьПараметр("Ссылка",Ссылка);
		ЗапросОстатки.УстановитьПараметр("Дата",Новый Граница(МоментВремени(),ВидГраницы.Включая));
		Результат = ЗапросОстатки.Выполнить();
		Если не Результат.Пустой() тогда
			Отказ = Истина;
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() цикл
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Товара """+Выборка.Товар.Наименование+""" нет на складе "+Поставщик.Наименование+" в необходимом количестве, нужно ещё "+ (-Выборка.ОстатокОстаток);
				Сообщение.Сообщить(); 
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если РазрешитьПродажу и не ДополнительныеСвойства.Свойство("ЭтоОбмен") тогда
		Документы.Приходная.СоздатьПретензии(Ссылка);
	КонецЕсли;	
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Инвентаризация") Тогда
		Товары.Очистить();
		Если не ЗначениеЗаполнено(Дата) тогда
			Дата =  ДанныеЗаполнения.Дата;
		КонецЕсли;
		Получатель = ДанныеЗаполнения.Склад.АдресХранения.СкладПотерь;;
		Поставщик = ДанныеЗаполнения.Склад;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Для каждого Строка из ДанныеЗаполнения.СписаниеПоПартиям цикл
			Стр = Товары.Добавить();	
			ЗаполнитьЗначенияСвойств(Стр,Строка);
			Стр.Цена = Стр.Партия.ЗакупочнаяЦена;
			Стр.Сумма = Стр.Цена * стр.Количество;
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если СборкаНаТСД тогда
		СборкаЗавершена = Ложь;
		Для каждого строка из Товары цикл
			Строка.Количество = 0;
		КонецЦикла;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сборка.Ссылка
		|ИЗ
		|	Документ.Сборка КАК Сборка
		|ГДЕ
		|	Сборка.ДокументОснование = &ДокументОснование";
		Запрос.УстановитьПараметр("ДокументОснование",Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() цикл
			Об = Выборка.Ссылка.ПолучитьОбъект();
			Об.УстановитьПометкуУдаления(Истина);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьПризнакФормированияРасходаПоСкладуПоставщику(Поставщик) Экспорт
	Если ОбменАлгоритмыРИБД.ЭтоЦентральнаяБаза() тогда
		Возврат ПланыОбмена.ПланОбменаОбновлениями.НайтиПоРеквизиту("АдресХранения",Поставщик.АдресХранения).Пустая();
	Иначе
		Возврат Поставщик.АдресХранения = ПараметрыСеанса.ТекущийАдресХранения;
	КонецЕсли;
КонецФункции
